Autodesk.Revit.DB.ElementCategoryFilter.#ctor(Autodesk.Revit.DB.ElementId,System.Boolean)
Constructs a new instance of a filter to match elements by category, with the option to match all elements which are of the given category.
categoryId:
The category id to match.
inverted:
True if the filter should match all elements which are not of the given category.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The category was not valid for filtering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ElementCategoryFilter.#ctor(Autodesk.Revit.DB.ElementId)
Constructs a new instance of a filter to match elements by category.
categoryId:
The category id to match.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The category was not valid for filtering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011